
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250813080527" -> "packer-debian-13.0.0-20250813082633" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.50" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-master-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.50" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;master" -> "k3s,master"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:e1:05:b3" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:5c:27:8d" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "a965b6d5-e4ca-4cc1-b516-149cfc7f5af7" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250813080527" -> "packer-debian-13.0.0-20250813082633" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.51" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.51" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:11:85:63" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:fa:ba:77" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "9f4acdb5-1988-4fef-a748-308182700ed0" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250813080527" -> "packer-debian-13.0.0-20250813082633" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.52" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-02"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.52" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:7e:f4:30" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:ec:50:30" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "8527092e-ef08-45f7-84ca-252e78ab766b" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*